Tekla Open API Reference for Tekla Structures 2025
GeometricPlane Constructor
Overload List
Name | Description
GeometricPlane()
 Instantiates an XY-plane with the origin at (0,0,0).
GeometricPlane(CoordinateSystem)
 Instantiates a plane defined by the given coordinate system.
GeometricPlane(Point, Vector)
 Instantiates a plane defined by the given origin point and normal vector.
GeometricPlane(Point, Vector, Vector)
 Instantiates a plane defined by the given origin, X-axis vector and Y-axis vector.
Top
See Also
Reference
GeometricPlane Class
Tekla.Structures.Geometry3d Namespace